In [23]:
import pandas as pd
from sodapy import Socrata
from tqdm import tqdm
import os

import sqlalchemy as sa
from sqlalchemy import Table, MetaData, Column, Integer, text

## Get the data

Get the SF Data via API

In [4]:
## https://data.sfgov.org/resource/ramy-di5m.json - addresses with units
client = Socrata("data.sfgov.org", None)

WARNING:root:Requests made without an app_token will be subject to strict throttling limits.

In [5]:
addresses_with_units = {'api':'ramy-di5m', 'max_rows': 388000}
evictions = {'api':'5cei-gny5', 'max_rows': 43400}
buyout_agreements = {'api':'wmam-7g8d', 'max_rows': 5900}

In [6]:
results_addresses_with_units = client.get(addresses_with_units['api'], limit=addresses_with_units['max_rows'])
results_evictions = client.get(evictions['api'], limit=evictions['max_rows'])
results_buyout_agreements = client.get(buyout_agreements['api'], limit=buyout_agreements['max_rows'])

In [7]:
# Convert to pandas DataFrames
df_addresses_with_units = pd.DataFrame.from_records(results_addresses_with_units)
df_evictions = pd.DataFrame.from_records(results_evictions)
df_buyout_agreements = pd.DataFrame.from_records(results_buyout_agreements)

In [8]:
## make sure we have the same number of rows as is listed in the UI
print(f'Addresses with units dataframe size: {df_addresses_with_units.shape[0]}') 
print(f'Evictions dataframe size: {df_evictions.shape[0]}') 
print(f'Buyout Agreements dataframe size: {df_buyout_agreements.shape[0]}')

Addresses with units dataframe size: 386974
Evictions dataframe size: 43393
Buyout Agreements dataframe size: 5855

In [9]:
df_addresses_with_units.head()

,eas_baseid,eas_subid,eas_fullid,address,address_number,street_name,street_type,cnn,longitude,latitude,...,nhood,:@computed_region_6qbp_sg9q,:@computed_region_qgnn_b9vv,:@computed_region_26cr_cadq,:@computed_region_ajp5_b2md,unit_number,parcel_number,block,lot,address_number_suffix
0,320333,535664,320333-535664-0,1427 08TH AVE,1427,08TH,AVE,397000,-122.46539954,37.76165344,...,Inner Sunset,109,10,11,14,NaN,NaN,NaN,NaN,NaN
1,476138,709408,476138-709408-0,1855 MARKET ST,1855,MARKET,ST,8760102,-122.42422754,37.77078018,...,Mission,27,1,5,20,NaN,NaN,NaN,NaN,NaN
2,307314,522448,307314-522448-0,404 08TH AVE,404,08TH,AVE,390000,-122.46605237,37.78063001,...,Inner Richmond,5,8,4,11,NaN,NaN,NaN,NaN,NaN
3,462177,682964,462177-682964-0,88 HOFF ST,88,HOFF,ST,6935000,-122.4207192,37.76390669,...,Mission,53,3,2,20,NaN,NaN,NaN,NaN,NaN
4,447006,667707,447006-667707-0,1438 GREEN ST,1438,GREEN,ST,6467000,-122.42287957,37.79811612,...,Russian Hill,105,4,3,32,NaN,NaN,NaN,NaN,NaN

Get the ZipAtlas Data via CSVs, locally

In [10]:
# As dataframes
df_median_age = pd.read_csv('median-age.csv')
df_population_density = pd.read_csv('population-density.csv')
df_median_household_income = pd.read_csv('median-household-income.csv')

## Connect to the Azure SQL Database

In [33]:
# set environ variables like: 
##os.environ['AZURE_MSDS432_USERNAME'] = <username>
##os.environ['AZURE_MSDS432_PASSWORD'] = <password>

In [34]:
## You must have this driver installed on your local machine

username = os.getenv('AZURE_MSDS432_USERNAME')
password = os.getenv('AZURE_MSDS432_PASSWORD')
host = 'mysqlserver-432.database.windows.net'
database = 'mySampleDatabase'
authentication = "SqlPassword"
conn_string = sa.engine.url.URL(
     "mssql+pyodbc",
     username=username,
     password=password,
     host=host,
     port=1433,
     database=database,
     query={"driver": "ODBC Driver 18 for SQL Server", "authentication": authentication}
 )

In [35]:
engine = sa.create_engine(conn_string, pool_timeout=60)
connection = engine.connect()

## Check what tables we have now

In [36]:
check_tables_query = """
SELECt schema_name(t.schema_id) as schema_name,
       t.name as table_name,
       t.create_date,
       t.modify_date
FROM sys.tables t
ORDER BY schema_name,
         table_name;
"""

tables = pd.read_sql_query(check_tables_query, connection)

In [37]:
tables

,schema_name,table_name,create_date,modify_date
0,dbo,BuildVersion,2022-05-15 20:04:00.113,2022-05-15 20:04:01.767
1,dbo,ErrorLog,2022-05-15 20:04:00.113,2022-05-15 20:04:01.767
2,dbo,EvictionNotices,2022-05-15 23:20:56.557,2022-05-15 23:20:56.557
3,dbo,SF_Buyout_Agreements_Raw,2022-05-16 00:27:00.917,2022-05-16 00:27:00.943
4,dbo,Zip_Atlas_Median_Age_Raw,2022-05-16 00:26:38.500,2022-05-16 00:26:38.530
5,dbo,Zip_Atlas_Median_Household_Income_Raw,2022-05-16 00:26:44.743,2022-05-16 00:26:44.773
6,dbo,Zip_Atlas_Population_Density_Raw,2022-05-16 00:26:41.683,2022-05-16 00:26:41.693
7,SalesLT,Address,2022-05-15 20:04:00.113,2022-05-15 20:04:01.920
8,SalesLT,Customer,2022-05-15 20:04:00.093,2022-05-15 20:04:01.930
9,SalesLT,CustomerAddress,2022-05-15 20:04:00.117,2022-05-15 20:04:01.827
10,SalesLT,Product,2022-05-15 20:04:00.103,2022-05-15 20:04:01.960
11,SalesLT,ProductCategory,2022-05-15 20:04:00.110,2022-05-15 20:04:01.857
12,SalesLT,ProductDescription,2022-05-15 20:04:00.103,2022-05-15 20:04:01.870
13,SalesLT,ProductModel,2022-05-15 20:04:00.093,2022-05-15 20:04:01.883
14,SalesLT,ProductModelProductDescription,2022-05-15 20:04:00.103,2022-05-15 20:04:01.883
15,SalesLT,SalesOrderDetail,2022-05-15 20:04:00.117,2022-05-15 20:04:01.963
16,SalesLT,SalesOrderHeader,2022-05-15 20:04:00.117,2022-05-15 20:04:01.990

## Upload the raw tables

In [15]:
## Write raw tables to our database: Zip Atlas
engine = sa.create_engine(conn_string, pool_timeout=60)

df_median_age.to_sql('Zip_Atlas_Median_Age_Raw', con=engine, if_exists='replace', index_label='id')
df_population_density.to_sql('Zip_Atlas_Population_Density_Raw', con=engine, if_exists='replace', index_label='id')
df_median_household_income.to_sql('Zip_Atlas_Median_Household_Income_Raw', con=engine, if_exists='replace', index_label='id')

There are some weird columns in the datasets we get from the API that I'll just drop for now

In [16]:
df_evictions_columns_cleaned = df_evictions[df_evictions.columns.drop(list(df_evictions.filter(regex='@computed')))]
df_buyout_agreements_columns_cleaned = df_buyout_agreements[df_buyout_agreements.columns.drop(list(df_buyout_agreements.filter(regex='@computed')))]
df_addresses_with_units_columns_cleaned = df_addresses_with_units[df_addresses_with_units.columns.drop(list(df_addresses_with_units.filter(regex='@computed')))]

In [17]:
## Convert all the columns to strings - we'll need to update the dtype later

for column in df_evictions_columns_cleaned.columns:
    df_evictions_columns_cleaned = df_evictions_columns_cleaned.astype({column: str})

for column in df_buyout_agreements_columns_cleaned.columns:
    df_buyout_agreements_columns_cleaned = df_buyout_agreements_columns_cleaned.astype({column: str})
    
for column in df_addresses_with_units_columns_cleaned.columns:
    df_addresses_with_units_columns_cleaned = df_addresses_with_units_columns_cleaned.astype({column: str})

In [18]:
## Write raw tables to our database: SF Dataset
engine = sa.create_engine(conn_string, pool_timeout=60)

df_buyout_agreements_columns_cleaned.to_sql('SF_Buyout_Agreements_Raw', con=engine, if_exists='replace', index_label='id')

In [38]:
## the other two dataframes are very large.. it would help to have a progress bar
## Credit to: https://stackoverflow.com/questions/39494056/progress-bar-for-pandas-dataframe-to-sql

def chunker(seq, size):
    # from http://stackoverflow.com/a/434328
    return (seq[pos:pos + size] for pos in range(0, len(seq), size))

def insert_with_progress(df, connection_string, table_name):
    engine = sa.create_engine(connection_string, pool_timeout=60)
    chunksize = int(len(df) / 10) # 10%
    with tqdm(total=len(df)) as pbar:
        for i, cdf in enumerate(chunker(df, chunksize)):
            replace = "replace" if i == 0 else "append"
            cdf.to_sql(name=table_name, con=engine, if_exists=replace, index_label='id')
            pbar.update(chunksize)

In [39]:
insert_with_progress(df_evictions_columns_cleaned, conn_string, 'SF_Eviction_Notices_Raw')

47729it [09:45, 81.54it/s]

In [40]:
#TODO: Update addresses with units dataframe

#insert_with_progress(df_addresses_with_units_columns_cleaned, conn_string, 'SF_Addresses_With_Units_Raw')

## Check to see if it worked

In [42]:
tables = pd.read_sql_query(check_tables_query, connection)
tables

,schema_name,table_name,create_date,modify_date
0,dbo,BuildVersion,2022-05-15 20:04:00.113,2022-05-15 20:04:01.767
1,dbo,ErrorLog,2022-05-15 20:04:00.113,2022-05-15 20:04:01.767
2,dbo,EvictionNotices,2022-05-15 23:20:56.557,2022-05-15 23:20:56.557
3,dbo,SF_Buyout_Agreements_Raw,2022-05-16 00:27:00.917,2022-05-16 00:27:00.943
4,dbo,SF_Eviction_Notices_Raw,2022-05-16 00:41:20.143,2022-05-16 00:41:20.190
5,dbo,Zip_Atlas_Median_Age_Raw,2022-05-16 00:26:38.500,2022-05-16 00:26:38.530
6,dbo,Zip_Atlas_Median_Household_Income_Raw,2022-05-16 00:26:44.743,2022-05-16 00:26:44.773
7,dbo,Zip_Atlas_Population_Density_Raw,2022-05-16 00:26:41.683,2022-05-16 00:26:41.693
8,SalesLT,Address,2022-05-15 20:04:00.113,2022-05-15 20:04:01.920
9,SalesLT,Customer,2022-05-15 20:04:00.093,2022-05-15 20:04:01.930
10,SalesLT,CustomerAddress,2022-05-15 20:04:00.117,2022-05-15 20:04:01.827
11,SalesLT,Product,2022-05-15 20:04:00.103,2022-05-15 20:04:01.960
12,SalesLT,ProductCategory,2022-05-15 20:04:00.110,2022-05-15 20:04:01.857
13,SalesLT,ProductDescription,2022-05-15 20:04:00.103,2022-05-15 20:04:01.870
14,SalesLT,ProductModel,2022-05-15 20:04:00.093,2022-05-15 20:04:01.883
15,SalesLT,ProductModelProductDescription,2022-05-15 20:04:00.103,2022-05-15 20:04:01.883
16,SalesLT,SalesOrderDetail,2022-05-15 20:04:00.117,2022-05-15 20:04:01.963
17,SalesLT,SalesOrderHeader,2022-05-15 20:04:00.117,2022-05-15 20:04:01.990

### Get the row count for each table

In [44]:
tables = ['Zip_Atlas_Median_Age_Raw', 'Zip_Atlas_Median_Household_Income_Raw', 'Zip_Atlas_Population_Density_Raw', 
           'SF_Buyout_Agreements_Raw', 'SF_Eviction_Notices_Raw'] #, 'SF_Addresses_With_Units_Raw']

def get_row_count(tables_to_check):
    '''
    Checks the row count of tables passed to the function, and outputs
    a dataframe with the tablename and row count
    '''
    
    tables = []
    rows = []
    
    for table in tables_to_check:
        get_count_query = """
            SELECT COUNT(*) count
            FROM dbo.{};
        """.format(table)
        
        engine = sa.create_engine(conn_string, pool_timeout=60)
        connection = engine.connect()
        results = connection.execute(text(get_count_query))
        for row in results:
            rows.append(row['count'])
        
        tables.append(table)
        
    row_count = {
        'Table Name': tables, 
        'Record Count': rows
    }
    
    df = pd.DataFrame(row_count)
    return df

row_counts = get_row_count(tables)

In [45]:
row_counts

                              Table Name  Record Count
0               Zip_Atlas_Median_Age_Raw            26
1  Zip_Atlas_Median_Household_Income_Raw            28
2       Zip_Atlas_Population_Density_Raw            26
3               SF_Buyout_Agreements_Raw          5855
4                SF_Eviction_Notices_Raw         43393

## Drop the tables, if necessary

In [21]:
## Drop the table
#engine = sa.create_engine(conn_string, pool_timeout=60)

#engine.execute("DROP TABLE dbo.SF_Buyout_Agreements_Raw;")
#engine.execute("DROP TABLE dbo.SF_Addresses_With_Units_Raw;")
#engine.execute("DROP TABLE dbo.SF_Eviction_Notices_Raw;")
#engine.execute("DROP TABLE dbo.Zip_Atlas_Median_Age;")
#engine.execute("DROP TABLE dbo.Zip_Atlas_Median_Household_Income;")
#engine.execute("DROP TABLE dbo.Zip_Atlas_Population_Density;")